__file__ = "机器学习基础"

"""
模式识别（pattern recognition）: 模式识别是最古老的（作为一个术语而言，可以说是很过时的）。
    我们把环境与客体统称为“模式”，识别是对模式的一种认知，是如何让一个计算机程序去做一些看起来很“智能”的事情。
    通过融于智慧和直觉后，通过构建程序，识别一些事物，而不是人，例如: 识别数字。

机器学习（machine learning）: 机器学习是最基础的（当下初创公司和研究实验室的热点领域之一）。
    在90年代初，人们开始意识到一种可以更有效地构建模式识别算法的方法，那就是用数据（可以通过廉价劳动力采集获得）去替换专家（具有很多图像方面知识的人）。
    “机器学习”强调的是，在给计算机程序（或者机器）输入一些数据后，它必须做一些事情，那就是学习这些数据，而这个学习的步骤是明确的。
    机器学习（Machine Learning）是一门专门研究计算机怎样模拟或实现人类的学习行为，以获取新的知识或技能，重新组织已有的知识结构使之不断改善自身性能的学科。

深度学习（deep learning）: 深度学习是非常崭新和有影响力的前沿领域，我们甚至不会去思考-后深度学习时代。
    深度学习是机器学习研究中的一个新的领域，其动机在于建立、模拟人脑进行分析学习的神经网络，它模仿人脑的机制来解释数据，例如图像，声音和文本。


机器学习 组成
主要任务:
分类（classification）：将实例数据划分到合适的类别中。
    应用实例：判断网站是否被黑客入侵（二分类 ），手写数字的自动识别（多分类）
回归（regression）：主要用于预测数值型数据。
    应用实例：股票价格波动的预测，房屋价格的预测等。

机器学习 开发流程
    收集数据: 收集样本数据
    准备数据: 注意数据的格式
    分析数据: 为了确保数据集中没有垃圾数据；
    如果是算法可以处理的数据格式或可信任的数据源，则可以跳过该步骤；
    另外该步骤需要人工干预，会降低自动化系统的价值。
    训练算法: [机器学习算法核心]如果使用无监督学习算法，由于不存在目标变量值，则可以跳过该步骤
    测试算法: [机器学习算法核心]评估算法效果
    使用算法: 将机器学习算法转为应用程序



























































"""